<?php

return [
    'text' => '
さらなる KosenProconTwitter の発展を画策する kyumina くんは、たくさんフォローされている人気者の高専生に広告をお願いするため、
最もフォローされているユーザを特定することにしました。しかし、 kyumina くんはSQLに明るくないため複数のテーブルにまたがってデータを取得することができませんでした。
そのくせ、あなたの偉大なる SQL 力に嫉妬した kyumina くんは、ユーザ名をフォロー数の少ない順に取得したい、と言い出しました。
あなたの任務は、 kyumina くんにかわって、被フォロー数の最も多いユーザ50人のユーザ名をフォロー数の少ない順に取得することです。
ユーザのフォロー関係を表す follow_relations テーブルを有効に活用しましょう。

あなた「サブクエリをうまく使えば……できる気がする……」',
    'name' => 'Kyumina くんと人気者',
    'point' => 330,
    'answer_query' => '',
];